import my_tools
# Python шукає власні модулі у поточній директорії проєкту,
# а також у каталогах, що містяться в системному списку sys.path.
# import my_tools
# Імпортує весь модуль і звернення до функцій відбувається через крапку.
# from my_tools import greet
# Імпортує лише конкретну функцію і дозволяє викликати її без назви модуля.
print(my_tools.greet("Микола"))
print(f"Квадрат числа: {my_tools.square(5)}")
print(f"Число парне: {my_tools.is_even(10)}")
print(
    f"Ім’я після форматування: {my_tools.format_name('Микола')}"
)