# Крок : Робота зі зрізами

text = "Python Programming"

# Перші 6 символів
print("Перші 6 символів:", text[:6])

# Останні 5 символів
print("Останні 5 символів:", text[-5:])

# Кожен другий символ
print("Кожен другий символ:", text[::2])

# Реверс рядка
print("Рядок навпаки:", text[::-1])


# Крок : Перевірка на паліндром

word = input("Введіть слово: ")

# Переведення у нижній регістр
word = word.lower()

# Перевірка
if word == word[::-1]:
    print("Це паліндром")
else:
    print("Це не паліндром")