# Оголошення змінної first_name типу str (ім'я)
first_name = "Микола"
# Оголошення змінної last_name типу str (прізвище)
last_name = "Дигідь"
# Оголошення змінної age типу int (вік)
age = 16
# Оголошення змінної height типу float (зріст у метрах)
height = 1.64
# Оголошення змінної is_student типу bool (чи є студентом)
is_student = True
# Виведення імені з пояснювальним текстом
print("Моє ім'я:", first_name)
# Виведення прізвища з пояснювальним текстом
print("Моє прізвище:", last_name)
# Виведення віку з пояснювальним текстом
print("Мій вік:", age)
# Виведення зросту з пояснювальним текстом
print("Мій зріст:", height)
# Виведення статусу навчання з пояснювальним текстом
print("Чи я студент:", is_student)